CoreMaker-lab/RA4M2_MINI/RA4M2_MINI_Project13/src/hal_entry.c
#include "hal_data.h"
#include <stdio.h>
FSP_CPP_HEADER
void R_BSP_WarmStart(bsp_warm_start_event_t event);
FSP_CPP_FOOTER

fsp_err_t err = FSP_SUCCESS;
volatile bool uart_send_complete_flag = false;
volatile bool g_receive_complete  = false;
#define TRANSFER_LENGTH_1  10
uint8_t  g_out_of_band_received[TRANSFER_LENGTH_1];
uint32_t g_out_of_band_index = 0;
void user_uart_callback (uart_callback_args_t * p_args)
{

    if(p_args->event == UART_EVENT_TX_COMPLETE)
    {
        uart_send_complete_flag = true;
    }
    else if(p_args->event == UART_EVENT_RX_COMPLETE)
    {
        g_receive_complete  = true;
    }
    else if(p_args->event == UART_EVENT_RX_CHAR)
    {
        /* Only put the next character in the receive buffer if there is space for it */
        if (sizeof(g_out_of_band_received) > g_out_of_band_index)
        {
            /* Write either the next one or two bytes depending on the receive data size */
            if (UART_DATA_BITS_8 >= g_uart9_cfg.data_bits)
            {
                g_out_of_band_received[g_out_of_band_index++] = (uint8_t) p_args->data;
                }
            else
            {
                uint16_t * p_dest = (uint16_t *) &g_out_of_band_received[g_out_of_band_index];
                *p_dest              = (uint16_t) p_args->data;
                g_out_of_band_index += 2;
                 }
        }

    }

}

#ifdef __GNUC__                                 //串口重定向
    #define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
    #define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif


PUTCHAR_PROTOTYPE
{
        err = R_SCI_UART_Write(&g_uart9_ctrl, (uint8_t *)&ch, 1);
        if(FSP_SUCCESS != err) __BKPT();
        while(uart_send_complete_flag == false){}
        uart_send_complete_flag = false;
        return ch;
}

int _write(int fd,char *pBuffer,int size)
{
    for(int i=0;i<size;i++)
    {
        __io_putchar(*pBuffer++);
    }
    return size;
}


/*******************************************************************************************************************//**
 * main() is generated by the RA Configuration editor and is used to generate threads if an RTOS is used.  This function
 * is called by main() when no RTOS is used.
 **********************************************************************************************************************/
void hal_entry(void)
{
    /* TODO: add your own code here */

    /* Open the transfer instance with initial configuration. */
    err = R_SCI_UART_Open(&g_uart9_ctrl, &g_uart9_cfg);
    assert(FSP_SUCCESS == err);

    unsigned char buff[]="RA E2STUDIO";
    uint8_t buff_len = strlen(buff);
    err = R_SCI_UART_Write(&g_uart9_ctrl, buff, buff_len);
    if(FSP_SUCCESS != err) __BKPT();
        while(uart_send_complete_flag == false){}
    uart_send_complete_flag = false;


    unsigned char send_buff[100];
    sprintf(send_buff, "\nHello World!.\n");
    uint8_t len = strlen(send_buff);
    err = R_SCI_UART_Write(&g_uart9_ctrl, send_buff, len);
    if(FSP_SUCCESS != err) __BKPT();
        while(uart_send_complete_flag == false){}
    uart_send_complete_flag = false;
    memset(send_buff, '\0', sizeof(100));


    int int_i=0;
    float float_i=66.20f;
    char char_i[]="hello e2studio";

//    uint8_t  TRANSFER_LENGTH=10;
//    uint8_t  g_dest[TRANSFER_LENGTH];
//    R_SCI_UART_Read(&g_uart9_ctrl, g_dest, TRANSFER_LENGTH);

    while(1)
    {
//        if(g_receive_complete==1)
//        {
//            g_receive_complete=0;
//            err = R_SCI_UART_Write(&g_uart9_ctrl, g_dest, TRANSFER_LENGTH);
//            if(FSP_SUCCESS != err) __BKPT();
//                while(uart_send_complete_flag == false){}
//        }
        if(g_out_of_band_index==10)
        {
            g_out_of_band_index=0;
            err = R_SCI_UART_Write(&g_uart9_ctrl, g_out_of_band_received, TRANSFER_LENGTH_1);
            if(FSP_SUCCESS != err) __BKPT();
                while(uart_send_complete_flag == false){}
        }


         R_BSP_SoftwareDelay(1000, BSP_DELAY_UNITS_MILLISECONDS); //
    }



#if BSP_TZ_SECURE_BUILD
    /* Enter non-secure code */
    R_BSP_NonSecureEnter();
#endif
}

/*******************************************************************************************************************//**
 * This function is called at various points during the startup process.  This implementation uses the event that is
 * called right before main() to set up the pins.
 *
 * @param[in]  event    Where at in the start up process the code is currently at
 **********************************************************************************************************************/
void R_BSP_WarmStart(bsp_warm_start_event_t event)
{
    if (BSP_WARM_START_RESET == event)
    {
#if BSP_FEATURE_FLASH_LP_VERSION != 0

        /* Enable reading from data flash. */
        R_FACI_LP->DFLCTL = 1U;

        /* Would normally have to wait tDSTOP(6us) for data flash recovery. Placing the enable here, before clock and
         * C runtime initialization, should negate the need for a delay since the initialization will typically take more than 6us. */
#endif
    }

    if (BSP_WARM_START_POST_C == event)
    {
        /* C runtime environment and system clocks are setup. */

        /* Configure pins. */
        R_IOPORT_Open (&IOPORT_CFG_CTRL, &IOPORT_CFG_NAME);

#if BSP_CFG_SDRAM_ENABLED

        /* Setup SDRAM and initialize it. Must configure pins first. */
        R_BSP_SdramInit(true);
#endif
    }
}

#if BSP_TZ_SECURE_BUILD

FSP_CPP_HEADER
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ();

/* Trustzone Secure Projects require at least one nonsecure callable function in order to build (Remove this if it is not required to build). */
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ()
{

}
FSP_CPP_FOOTER

#endif
